---
kind: type
id: T:Autodesk.Revit.DB.PointClouds.PointCloudOverrideSettings
source: html/48196ce4-89a6-8f23-a82c-190f0113380d.htm
---
# Autodesk.Revit.DB.PointClouds.PointCloudOverrideSettings

The graphic override settings for one PointCloudInstance element or one of its scans.

## Syntax (C#)
```csharp
public class PointCloudOverrideSettings : IDisposable
```